#include "fir.h"
#include "arm_math.h"
#include "malloc.h"

#define NUM_TAPS 21  // 系数个数
#define BLOCK_SIZE 1 // 每次处理的数据个数

/**
 * @note 阶数 20
 * @note 采样频率 20kHz
 * @note 截至频率 100Hz
 * @note 窗函数 汉明窗
 */
const float firCoeffs_100Hz[21] = {
    0.007252480835, 0.009322776459, 0.01530767977, 0.02464949898, 0.03645113111,
    0.04956446588, 0.06270454079, 0.07457792759, 0.08401242644, 0.0900747776,
    0.09216459095, 0.0900747776, 0.08401242644, 0.07457792759, 0.06270454079,
    0.04956446588, 0.03645113111, 0.02464949898, 0.01530767977, 0.009322776459,
    0.007252480835};

const float B[21] = {
    0.007327774074, 0.009397343732, 0.01539759524, 0.02474823222, 0.03653828427,
    0.04961542413, 0.06269923598, 0.07450718433, 0.08388094604, 0.08990052342,
    0.09197494388, 0.08990052342, 0.08388094604, 0.07450718433, 0.06269923598,
    0.04961542413, 0.03653828427, 0.02474823222, 0.01539759524, 0.009397343732,
    0.007327774074};

/**
 * @brief fir滤波初始化
 */
void firFilterInit(arm_fir_instance_f32 **S, const float *firCoeffs, float *firState)
{
    *S = (arm_fir_instance_f32 *)malloc(sizeof(arm_fir_instance_f32));
    arm_fir_init_f32(*S, NUM_TAPS, firCoeffs, firState, BLOCK_SIZE);
}
